1- Найдите все натуральные числа (возможно, окружённые буквами)

\d+

____________________________________________
2- Найдите все «слова», написанные капсом

[А-ЯЁA-Z]+

____________________________________________
3- Найдите слова, в которых есть русская буква, а за ней цифра

[А-Яа-яЁё]\d

____________________________________________
4- Найдите все слова, начинающиеся с русской или латинской большой буквы

\b[А-ЯЁA-Z]\w*

____________________________________________
5- Найдите слова, которые начинаются на гласную

\b[АЕЁИОУЫЭЮЯаеёиоуыэюяAEIOUYaeiouy]\w*
____________________________________________

6- Найдите все натуральные числа, не находящиеся на границе слова

(?<=\w)\d+|\d+(?=\w)

____________________________________________
7- Найдите строчки, в которых есть символ *

^.*\*.*$

____________________________________________
8- Найдите строчки, в которых есть открывающая и когда-нибудь потом закрывающая скобки

^.*\(.*\).*$
____________________________________________

9- Выделите одним махом весь кусок оглавления вместе с тегами

(<a.*?</a>;?\n?)+

____________________________________________
10- Выделите только текстовую часть оглавления, без тегов

(?<=>).*?(?=</a>)

____________________________________________
11- Найдите пустые строчки

^\s*$

____________________________________________
12- Найти все теги, не включая их содержимое

<[^>]+>
